In [1]:
import pandas as pd
import numpy as np
import random as rnd

import seaborn as sns
import matplotlib.pyplot as plt


from sklearn.linear_model import LogisticRegression
from sklearn.svm import SVC, LinearSVC
from sklearn.ensemble import RandomForestClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.naive_bayes import GaussianNB
from sklearn.linear_model import Perceptron
from sklearn.linear_model import SGDClassifier
from sklearn.tree import DecisionTreeClassifier


train_df = pd.read_csv('../input/train.csv')
test_df = pd.read_csv('../input/test.csv')

combine = [train_df, test_df]

In [2]:
print("After", train_df.shape, test_df.shape, combine[0].shape, combine[1].shape)

After (891, 12) (418, 11) (891, 12) (418, 11)

In [3]:
for dataset in combine:
    dataset['Title'] = dataset.Name.str.extract('([A-Za-z]+)\.',expand=False)

pd.crosstab(train_df["Title"], train_df['Sex'])

Sex       female  male
Title
Capt           0     1
Col            0     2
Countess       1     0
Don            0     1
Dr             1     6
Jonkheer       0     1
Lady           1     0
Major          0     2
Master         0    40
Miss         182     0
Mlle           2     0
Mme            1     0
Mr             0   517
Mrs          125     0
Ms             1     0
Rev            0     6
Sir            0     1

In [10]:
momo = []
for i in combine:
    print("momo " + i.Name)

0                           momo Braund, Mr. Owen Harris
1      momo Cumings, Mrs. John Bradley (Florence Brig...
2                            momo Heikkinen, Miss. Laina
3      momo Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                          momo Allen, Mr. William Henry
                             ...
886                           momo Montvila, Rev. Juozas
887                    momo Graham, Miss. Margaret Edith
888        momo Johnston, Miss. Catherine Helen "Carrie"
889                           momo Behr, Mr. Karl Howell
890                             momo Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object
0                                  momo Kelly, Mr. James
1                  momo Wilkes, Mrs. James (Ellen Needs)
2                         momo Myles, Mr. Thomas Francis
3                                  momo Wirz, Mr. Albert
4      momo Hirvonen, Mrs. Alexander (Helga E Lindqvist)
                             ...
413                              momo Spector, Mr. Woolf
414                    momo Oliva y Ocana, Dona. Fermina
415                    momo Saether, Mr. Simon Sivertsen
416                             momo Ware, Mr. Frederick
417                        momo Peter, Master. Michael J
Name: Name, Length: 418, dtype: object

In [10]:
combine[0].Name.str.extract('([A-Za-z]+)\.')

        0
0      Mr
1     Mrs
2    Miss
3     Mrs
4      Mr
..    ...
886   Rev
887  Miss
888  Miss
889    Mr
890    Mr

[891 rows x 1 columns]

In [11]:
combine[0].Name.head()

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

In [14]:
for i in range(0,4):
    for j in range(5,8):
        print(i, " " ,j)

0   5
0   6
0   7
1   5
1   6
1   7
2   5
2   6
2   7
3   5
3   6
3   7

In [16]:
pd.cut(train_df['Age'], 5)

0      (16.336, 32.252]
1      (32.252, 48.168]
2      (16.336, 32.252]
3      (32.252, 48.168]
4      (32.252, 48.168]
             ...
886    (16.336, 32.252]
887    (16.336, 32.252]
888                 NaN
889    (16.336, 32.252]
890    (16.336, 32.252]
Name: Age, Length: 891, dtype: category
Categories (5, interval[float64]): [(0.34, 16.336] < (16.336, 32.252] < (32.252, 48.168] < (48.168, 64.084] < (64.084, 80.0]]

In [5]:
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr